s = 'helloworld'
print('{0:*<20}'.format(s)) # 字符串的显示宽度为20，左对齐，空白部分用*号填充 helloworld**********、
print('{0:*>20}'.format(s)) # **********helloworld
print('{0:*^20}'.format(s)) # *****helloworld*****

# 居中对齐
print(s.center(20, '*')) # *****helloworld*****

#千位分隔符 只适用于整数 浮点数
print('{0:,}'.format(987654321)) # 987,654,321
print('{0:,}'.format(987654321.1122)) # 987,654,321.1122

# 浮点数小数部分的精度
print('{0:.2f}'.format(3.1415926)) # 3.14
# 字符串类型，表示是最大的显示长度
print('{0:.5}'.format('helloworld')) # hello

# 整数类型
a = 411
print('二进制:{0:b}, 十进制:{0:d}, 八进制:{0:o}, 十六进制:{0:x}'.format(a)) # 二进制:110011011, 十进制:411, 八进制:633, 十六进制:19b

# 浮点数类型
b = 3.141592653
print('{0:.2f}, {0:.2E}, {0:.2e}, {0:.2%}'.format(b)) # 3.14, 3.14E+00, 3.14e+00, 314.16%