n = 3 # 物品的数量
c = 8 # 背包的容量
v = [4, 2, 3] # 物品的体积
w = [5, 3, 4] # 物品的价值
dp = [[0] * (c + 1) for _ in range(n)] # n行c+1列的二维数组，dp[i][j]表示前i个物品在容量为j的背包中能获得的最大价值
# 初始化
for j in range(c + 1):
    if j >= v[0]:
        dp[0][j] = w[0]

# 遍历物品
for i in range(1, n):
    for j in range(c + 1):
        if j < v[i]: # 如果当前背包容量小于物品体积，则不能放入该物品
            dp[i][j] = dp[i - 1][j] # 不能放入该物品，则最大价值为前i-1个物品的最大价值
        else: # 如果当前背包容量大于等于物品体积，则可以选择放入或不放入该物品
            dp[i][j] = max(dp[i - 1][j], dp[i - 1][j - v[i]] + w[i])
print(dp[n - 1][c]) # 输出最大价值